In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employee2.csv')

In [3]:
df

   eno    ename age
0    1    nitya  20
1    2  namasvi  21
2    3     sonu  33
3    4    vidya  20
4    5    kaira
5    6     sonu  33
6    7    Shalu  20

In [4]:
df.shape

(7, 3)

In [5]:
df.columns

Index(['eno', 'ename', 'age'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [7]:
df.dtypes

eno       int64
ename    object
age      object
dtype: object

In [8]:
df.head(5)

   eno    ename age
0    1    nitya  20
1    2  namasvi  21
2    3     sonu  33
3    4    vidya  20
4    5    kaira

In [9]:
df.tail(2)

   eno  ename age
5    6   sonu  33
6    7  Shalu  20

In [10]:
df.head(3)

   eno    ename age
0    1    nitya  20
1    2  namasvi  21
2    3     sonu  33

In [11]:
df.info

<bound method DataFrame.info of    eno    ename age
0    1    nitya  20
1    2  namasvi  21
2    3     sonu  33
3    4    vidya  20
4    5    kaira
5    6     sonu  33
6    7    Shalu  20>

In [12]:
df.describe

<bound method NDFrame.describe of    eno    ename age
0    1    nitya  20
1    2  namasvi  21
2    3     sonu  33
3    4    vidya  20
4    5    kaira
5    6     sonu  33
6    7    Shalu  20>

In [13]:
df['ename']

0      nitya
1    namasvi
2       sonu
3      vidya
4      kaira
5       sonu
6      Shalu
Name: ename, dtype: object

In [14]:
df['age']

0    20
1    21
2    33
3    20
4
5    33
6    20
Name: age, dtype: object

In [15]:
df[['ename','age']]

     ename age
0    nitya  20
1  namasvi  21
2     sonu  33
3    vidya  20
4    kaira
5     sonu  33
6    Shalu  20

In [16]:
df

   eno    ename age
0    1    nitya  20
1    2  namasvi  21
2    3     sonu  33
3    4    vidya  20
4    5    kaira
5    6     sonu  33
6    7    Shalu  20

In [17]:
df.iloc[3,1]

'vidya'

In [18]:
df.iloc[2,2]

'33'

In [19]:
df.loc[2,'ename']

'sonu'

In [25]:
df1 = df.dropna

In [26]:
df1

   eno    ename age
0    1    nitya  20
1    2  namasvi  21
2    3     sonu  33
3    4    vidya  20
4    5    kaira
5    6     sonu  33
6    7    Shalu  20